app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-ADHF3A8Q8cLWGDyEhGn4w"], ["updated_at", "2020-04-28 19:49:15.688702"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = self.class.generate_sessoin_token
        self.save